import React, {Component} from 'react';
import styles from "../../static/css/help.scss";

class HelpUserIndex extends Component {
    render() {
        return (
            <div className={styles['helpUserMain']}>
                <h1>云辅助用户协议</h1>
                <h3> 欢迎进入云辅助手机平台！</h3>
                <p> 云辅助手机平台用户使用许可协议（以下简称“本协议”）由您和
                    < span> 深圳市码云科技网络有限公司 </span>（以下称“云辅助”）共同认可签署。在使用云辅助手机平台（以下称“本软件”）之前，请仔细阅读并透彻理解本协议，除非您接受本协议所有条款内容，否则您将无权下载、安装或使用本软件及相关服务。如果选择下载、安装、复制并继续使用本软件和服务，则视为用户同意认可本协议的所有条款，并接受各项条款的约束。
                </p>
                <p> 您与我们签署的本协议列明的条款并不能完整罗列并覆盖您与云辅助之间的所有权利与义务，现有的约定也不能保证完全符合未来发展的需求。云辅助有权随时根据有关法律法规的变化、公司经营状况和经营策略调整和软件升级等原因修订本协议。变更后的协议条款将会在云辅助官方网站或本软件上公布，一经公布立即生效，用户可随时查阅最新版协议。如果用户不同意协议变更内容，请立即停止使用本软件。如果用户继续使用本软件，则视为接受本协议的变更。</p>
                <p> 未满18周岁的未成年人应在法定监护人陪同下阅读本协议。</p>
                <h3> 一、定义 </h3>
                <p>“本软件”指：由云辅助开发的，供您从下载平台下载，并在相应系统手持移动终端和电脑端中安装、使用的软件系统。</p>
                <p> 本软件是一款集游戏、工具、礼包及其他手机软件应用的云手机平台，包含多种第三方软件和服务应用，本软件不提供内容制作。</p>
                <h3> 二、权利声明 </h3>
                <p>云辅助拥有本软件的版权，与本软件相关的所有信息内容均属于云辅助的知识产权，包括但不限于：本软件的文字表述及其组合、图标、图饰、图表、色彩、界面设计、版面框架、有关数据、印刷材料、或电子文档等，云辅助享有知识产权，受到相关法律法规的保护。任何未经授权而擅自修改、发行、出租、翻译、分割、反向编译或反向工程本软件程序的全部或部分行为，均属于侵权行为，云辅助保留依法追究其法律责任的权利。</p>
                <ol>
                    <li>本软件的名称、标识、UI、信息内容等包括以上标明的各种信息受法律保护，任何人不得复制、模仿；
                    </li>
                    <li>本软件受知识产权保护，任何第三方不得在未经官方同意下擅自修改、发行、出租、翻译、分割、反向编译或反向工程本软件；
                    </li>
                    <li>
                        本软件内的软件、游戏、文字、图片等信息由其他用户上传，用户可浏览、下载、存储、使用，但不得从事侵犯知识产权的活动；

                    </li>
                    <li>
                        用户在分享游戏、软件、链接地址时，应确认内容是合法的、不侵犯任何第三方知识产权的方可发布；

                    </li>
                    <li>

                        用户在浏览下载本软件中其他用户分享的信息时，发现有侵犯其他知识产权的言论，请及时通知云辅助。
                    </li>
                </ol>

                <h3>三、授权范围</h3>
                <p>云辅助授权用户非商业性地使用本软件，并为用户提供下载、安装、使用、升级、卸载和提供相关数据服务。用户可以自主选择下载、安装或卸载以及使用本软件，可以使用云辅助提供的相应数据服务，享受云辅助的维护升级服务。用户可以非商业性地复制和散发本软件。未经云辅助书面授权和许可，用户不得进行商业性的销售、复制、散发或其他商业活动。</p>
                <ol>
                    <li>

                        用户可以非商业性地下载、安装及使用本软件；
                    </li>
                    <li>
                        用户可以非商业性地复制、散发和传播本软件，但必须保证每一份复制、散发和传播的内容都是完整和真实的, 包括所有有关本软件产品的软件、电子文档、版权和商标以及本协议。

                    </li>
                    <li>
                        由于软件适配平台、操作系统及终端限制，用户仅可在本软件支持的系统平台及终端使用本软件。

                    </li>
                    <li>
                        云辅助会对本软件及其相关功能进行不定时变更、升级、修改或转移，并会在本软件系统中开发新的功能或其它服务，上述新的功能、软件服务如无独立协议的，用户仍可获取相应功能或服务，并适用本协议。

                    </li>
                </ol>

                <h3>四、软件使用授权</h3>
                <dl>
                    <dt>

                        1.软件使用须知：
                        <p>本软件是云辅助提供的一款旨在帮助用户创建移动智能手机健康生态应用模式，提供虚拟手机软件应用和服务的云手机平台。本软件前期主要为用户提供手机游戏24小时离线挂机、各种工具等应用和服务；后期将拓展至整个手机平台的应用软件的虚拟化应用。在使用前用户需认真了解以下内容：
                        </p>
                        <dl>
                            <dt>
                                (1)本软件支持手机游戏等手机应用软件的远程控制功能，让其在离线状态也能保持24h云端在线状态。对于不同型号及操作系统的手机，本软件的使用方法也不相同。
                            </dt>
                            <dt>
                                (2)使用本软件最佳前提保证手机电池电量高于20%，手机存储剩余空间大于10MB，以保证有足够电量及足够的空间完成获取过程。
                            </dt>
                            <dt>
                                (3)使用本软件需注册软件账号，即成为注册用户后方可使用本软件，注册用户如果违反本协议约定，云辅助有权暂停或终止用户的账号使用权。
                            </dt>
                            <dt>
                                (4)使用本软件在线查看接受到的文字、图片、文件等信息时，用户手机会产生相应的数据流量费，由运营商收取。
                            </dt>
                            <dt>
                                (5)本软件仅适用于其官方网站公布支持的操作系统，如果用户在安装本软件后因任何原因欲放弃使用，可使用各操作系统提供的删除方式删除本软件。
                            </dt>
                        </dl>
                    </dt>
                    <dt>
                        2.软件使用规则：
                        <p>用户应在遵守法律及本协议的前提下使用本软件，在使用本软件时用户不得违反以下两条内容：</p>
                        <dl>
                            <dt>
                                (1)用户不得使用本软件制作、复制、发布、传播、储存包括但不限于下列内容的信息：
                                <p>反对宪法所确定的基本原则的；</p>
                                <p>危害国家安全、泄露国家机密、国家政权、破坏国家统一的；</p>
                                <p>损害国家荣誉和利益的；</p>
                                <p>煽动民族仇恨、民族歧视，破坏民族团结的；</p>
                                <p>破坏国家宗教政策、宣扬邪教和封建迷信的；</p>
                                <p>散布谣言、扰乱社会秩序、破坏社会稳定的；</p>
                                <p>散布淫秽、色情、暴力、赌博、恐怖或教唆犯罪的；</p>
                                <p>侮辱或者诽谤他人，侵害他人合法权利的；</p>
                                <p>任何侵犯任何第三方作品的知识产权的；</p>
                                <p>侵害第三方姓名权、名誉权、肖像权、隐私权等各类合法权益的；</p>
                                <p>含有虚假、有害、胁迫、侵害他人隐私、骚扰、侵害、中伤、粗俗、猥亵、或其它道德上令人反感内容的；</p>
                                <p>含有中国法律、法规、规章、条例以及任何具有法律效力的规范所限制或禁止的其它内容的；</p>
                            </dt>
                            <dt>
                                (2)不得运用本软件进行包括但不限于以下范围的行为：
                                <p>故意避开或者破坏著作者、开发者为保护本软件著作权而采取的技术措施；</p>
                                <p>利用本软件误导、欺骗他人；</p>
                                <p>违反国家规定，对本软件系统功能进行删除、修改、增加、干扰，造成本软件不能正常运行；</p>
                                <p>破坏本软件系统的正常运行，故意传播计算机病毒等破坏性程序；</p>
                                <p>其他任何危害计算机信息网络安全的；</p>
                            </dt>
                        </dl>
                    </dt>
                    <dt>

                        3.对于从非云辅助指定站点或非云辅助自主发行的渠道下载的本软件产品，云辅助无法保证该软件是否感染计算机病毒、是否隐藏有伪装的木马程序或者黑客软件，使用此类软件，将可能导致不可预损失测的风险，建议用户不要轻易下载、安装、使用，云辅助不承担任何由此产生的损失和赔偿。

                    </dt>
                    <dt>
                        4.本软件不含有任何旨在破坏用户移动通讯设备数据和获取用户隐私信息的恶意代码，不含有任何跟踪、监视用户的功能代码，不会监控用户网上、网下的行为，不会收集用户使用其它软件、文档等个人信息，不会泄漏用户隐私。
                    </dt>
                </dl>
                <h3>五、第三方软件或服务</h3>
                <p>本软件可能使用或包含了由第三方提供的软件或服务（以下称“此类服务”），此类服务是响应用户需求，为了向用户提供更多便利而设置，云辅助不提供内容制作。用户使用此类服务时，应另行与该第三方达成服务协议，支付相应费用并承担可能的风险。用户如果继续使用本软件或服务，则表示用户默认一下几点：
                </p>
                <ol>
                    <li>
                        云辅助并无权在本协议中授予用户使用第三方软件或服务的任何权利，也无权对此类服务提供任何形式的保证以及相应的客户服务支持，如果您需要咨询相关信息，可直接与该第三方联系。如果用户因使用此类服务引发任何纠纷或造成任务损失，可直接与该第三方协商解决，云辅助不承担任何责任和赔偿。
                    </li>
                    <li>
                        本软件当前使用或包含此类服务，但本软件不保证将永久使用或包含此类服务，不保证将来不会使用除现有以外的其他同类或不同类型的软件或服务，一旦本软件中使用或包含前述软件或服务，其同样适用本协议规定。

                    </li>
                    <li>
                        当此类服务需要与云辅助进行用户信息交互以便更好地为用户提供服务时，针对同意在使用本软件时同时使用此类服务的用户，默认用户授权云辅助依据
                        《法律声明及隐私权政策》将用户使用本软件的信息传递给该第三方，或从该第三方获取您注册或使用此类服务时提供或产生的信息。如果您不希望第三方获取您的信息的，您可停止使用此类服务，云辅助将停止向第三方传递您的信息。
                    </li>
                    <li>
                        如果第三方确认您违反了您与其之间关于使用此类服务的协议约定，并停止对您提供此类服务，同时要求云辅助处理的情况，由于停止此类服务可能会影响您继续使用本软件，云辅助可能会中止或终止对您的软件使用许可或采取其他我们可对您采取的限制措施进行处理。
                    </li>
                </ol>
                <h3>
                    <span className="important">六、隐私权保护</span>
                </h3>
                <span
                    className="important">尊重用户隐私权是云辅助的一贯制度，云辅助将会采取合理的措施保护您的个人隐私信息。同时用户应自行承担因此可能产生的任何风险，云辅助对此不予负责。</span>
                <br/>
                <span
                    className="important">为了不断改进本软件的功能和服务，为用户提供更好的服务，在不涉及用户个人隐私前提下，云辅助会收集用户的一些信息，以改善优化本软件的应用体验；同时，用户使用本软件，也将涉及到一些用户隐私保密信息，为保护用户个人信息，云辅助制定了以下四项隐私权保护原则，指导处理产品中涉及到用户隐私权和用户信息等方面的问题：</span>
                <br
                />
                <span className="important">利用我们收集的信息为用户提供有价值的产品和服务；</span>
                <br/>
                <span className="important">开发符合隐私权标准和隐私权惯例的产品；</span>
                <br/>
                <span className="important">将个人信息的收集透明化，并由权威第三方监督；</span>
                <br/>
                <span className="important">尽最大的努力保护我们掌握的信息。</span>
                <br/>
                <span className="important">同时，本软件同样适用《云辅助隐私权保护声明》以及适用法律的规定。</span>
                <br/>

                <h3>七、协议终止和违约责任</h3>
                <p>用户应当在软件授权范围内使用本软件、尊重本软件及其所包含的知识产权、使用规范等相关内容；按本协议约定履行义务是用户使用本软件的前提，如严重违反本协议，云辅助将对该用户终止本协议。</p>
                <p>用户如果违反本软件和云辅助的相关使用要求、条款、协议、通告等内容，而被终止提供服务，由此可能导致用户无法正常使用本软件，云辅助有权对用户终止本协议。</p>
                <p>用户如果出于维护平台秩序及保护消费者权益的目的，向云辅助作出任何形式的承诺，在云辅助确认您违反了该承诺的前提下，云辅助可按您的承诺或协议约定的方式对您的使用本软件的权益采取限制措施，包括中止或终止本协议。</p>
                <p>如果用户违反本协议或与云辅助签订的其他协议约定，云辅助可对您在其中获得的权益采取限制措施，包括中止、终止对您提供部分或全部服务，且在云辅助官方平台依法公示您的违约情况。</p>
                <p>本软件由用户在各类下载平台自主下载获得，用户需遵守相应下载平台对您使用本软件的相关约定，如果上述第三方平台确认您违反该约定需要云辅助处理的情况，云辅助可能会因第三方要求终止您使用本软件或服务。</p>
                <p>在本协议终止时，用户应停止对本软件的使用行为, 并删除本软件的全部副本。</p>
                <p>如您违反本协议规定的条款，给云辅助及或其他用户造成损失，您必须承担全部的赔偿责任。如我们承担了上述责任，则您同意赔偿我们的相关支出和损失。</p>

                <h3>八、法律及争议解决</h3>
                <p>本协议的各项条款均适用中华人民共和国法律的相关规定。如无相关法律规定，则可参照行业惯例。</p>
                <p>云辅助可能根据业务调整而变更向您提供的软件或服务的主体，变更后，云辅助与您共同履行本协议，以上变更不会影响用户在本协议下的权益。发生争议时，用户可根据具体使用的服务及对其权益产生影响的具体行为对象确定与您履约的主体及争议相对方。</p>
                <p>因本协议引起的或与本协议有关的任何争议，各方应友好协商解决；如若协商不成，任何一方均可将有关争议诉诸法律方法解决。</p>

                <h3>九、其他条款</h3>
                <p>如果本协议中的任何条款无论因何种原因完全或部分无效，或不具备可执行力，均不影响其它条款的效力。</p>
                <p>云辅助有权随时根据有关法律法规的变更、公司经营状况和经营策略的调整等而变更向用户提供软件或服务的主体，同时有权随时据此修改本协议。修改后的协议会在云辅助官方网站或者本软件上公布，一经公布自动生效。当发生有关争议时，以最新的协议文本为准。如果不同意改动的内容，用户可以自行删除本软件。如果用户继续使用本软件，则视为您接受本协议的变动。</p>
                <br/>
                <p>请用户在使用本软件时，仔细阅读并遵守本许可协议和免责声明。</p>
                <p>云辅助在法律允许的最大范围内对本协议拥有解释权与修改权。</p>

            </div>
        );
    }
}

export default HelpUserIndex;